In [10]:
import seaborn as sns
from pyspark.ml import Pipeline
from pyspark.ml.feature import StringIndexer
from pyspark import SparkContext
from pyspark.sql import SQLContext # Main entry point for DataFrame and SQL functionality.

sc = SparkContext.getOrCreate()
sqlCtx = SQLContext(sc)

In [11]:
import pyspark
print(pyspark.__version__)

3.3.0

In [1]:
with open('./input/student.csv', mode = 'r', encoding = 'utf8') as f:
    data = f.readlines()

In [2]:
import pandas as pd
df_student = pd.read_csv('./input/student.csv')

In [3]:
data

['sno,FirstName,LASTNAME\n',
 'one,Ram,\n',
 'two,,Sharma\n',
 'three,Shyam,NA\n',
 'four,Kabir,\n',
 'five,NA,Singh\n']

In [4]:
df_student.head()

     sno FirstName LASTNAME
0    one       Ram      NaN
1    two       NaN   Sharma
2  three     Shyam      NaN
3   four     Kabir      NaN
4   five       NaN    Singh

# When you load a Pandas DataFrame by reading from a CSV, blank values and 'NA' values are converted to 'NaN' values by default as shown above.

In [5]:
def clean_data(df):
    df.fillna('Not Applicable', inplace = True) # Handles blank and 'NA' values both. 
    
    df = df.apply(lambda x: x.str.strip())
    df.columns = df.columns.str.lower()
    return df

In [6]:
df_student = clean_data(df_student)

In [7]:
df_student

     sno       firstname        lastname
0    one             Ram  Not Applicable
1    two  Not Applicable          Sharma
2  three           Shyam  Not Applicable
3   four           Kabir  Not Applicable
4   five  Not Applicable           Singh

df_student = pd.read_csv('./input/student.csv')
sdf = sqlCtx.createDataFrame(df_student)

# TypeError: field FirstName: Can not merge type <class 'pyspark.sql.types.StringType'> and <class 'pyspark.sql.types.DoubleType'>

In [13]:
df_student = pd.read_csv('./input/student.csv')
print(type(df_student))

<class 'pandas.core.frame.DataFrame'>

In [14]:
df_student

     sno FirstName LASTNAME
0    one       Ram      NaN
1    two       NaN   Sharma
2  three     Shyam      NaN
3   four     Kabir      NaN
4   five       NaN    Singh

In [15]:
df_student.fillna('Not Applicable', inplace = True) # Handles blank and 'NA' values both.

In [16]:
sdf = sqlCtx.createDataFrame(df_student)

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/pandas/conversion.py:474: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():
/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/pandas/conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [17]:
type(sdf)

pyspark.sql.dataframe.DataFrame

In [18]:
sdf.show()

+-----+--------------+--------------+
|  sno|     FirstName|      LASTNAME|
+-----+--------------+--------------+
|  one|           Ram|Not Applicable|
|  two|Not Applicable|        Sharma|
|three|         Shyam|Not Applicable|
| four|         Kabir|Not Applicable|
| five|Not Applicable|         Singh|
+-----+--------------+--------------+

In [19]:
from pyspark import pandas as ppd

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

WAY 2:
READING DATA FROM A CSV FILE IN PYSPARK

New feature in 3.2.1
https://spark.apache.org/docs/3.2.1/api/python/reference/pyspark.pandas/api/pyspark.pandas.read_csv.html

df = pyspark.pandas.read_csv('./input/student.csv') 

# Error if 'pandas' package is not there in your version of 'pyspark'.
# AttributeError: module 'pyspark' has no attribute 'pandas'

In [20]:
df_student_pyspark = ppd.read_csv('./input/student.csv')

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/pandas/utils.py:975: PandasAPIOnSparkAdviceWarning: If `index_col` is not specified for `read_csv`, the default index is attached which can cause additional overhead.
  warnings.warn(message, PandasAPIOnSparkAdviceWarning)

In [21]:
type(df_student_pyspark)

pyspark.pandas.frame.DataFrame

In [22]:
df_student_pyspark

     sno FirstName LASTNAME
0    one       Ram     None
1    two      None   Sharma
2  three     Shyam       NA
3   four     Kabir     None
4   five        NA    Singh

WAY 3:
READING DATA FROM A CSV FILE IN PYSPARK
https://spark.apache.org/docs/latest/sql-data-sources-csv.html

In [23]:
from pyspark.sql import SparkSession

spark = SparkSession \
    .builder \
    .appName("Python Spark SQL basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

22/10/08 21:44:33 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

In [24]:
# A CSV dataset is pointed to by path.
# The path can be either a single CSV file or a directory of CSV files
# path = "examples/src/main/resources/people.csv"

df = spark.read.option("header", True).csv('./input/student.csv')
df.show()

+-----+---------+--------+
|  sno|FirstName|LASTNAME|
+-----+---------+--------+
|  one|      Ram|    null|
|  two|     null|  Sharma|
|three|    Shyam|      NA|
| four|    Kabir|    null|
| five|       NA|   Singh|
+-----+---------+--------+

In [25]:
type(df)

pyspark.sql.dataframe.DataFrame